04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/misalignedDuct/0/fluid/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 297;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    external
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 312;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    "fluidNonCouple.*"
    {
        type            zeroGradient;
    }

    fluid_to_solid
    {
        type            coupledTemperature;
        value           $internalField;
    }
}

// ************************************************************************* //
